// Дано натуральное число N. Вывести на экран числа от 1 до N.

int N = 100;
int i =1;

while (i < N)
{
    // Console.WriteLine(i);
    Console.Write(i);
    Console.Write(' ');
    i = i + 1;
}